{
  "class_name": "Model",
  "config": {
    "name": "model_33",
    "layers": [
      {
        "name": "input_17",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            1,
            20,
            20
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_17"
        },
        "inbound_nodes": []
      },
      {
        "name": "conv2d_49",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_49",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            5,
            5
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "input_17",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "max_pooling2d_49",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_49",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            2,
            2
          ],
          "padding": "same",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "conv2d_49",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_50",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_50",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "max_pooling2d_49",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "max_pooling2d_50",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_50",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            2,
            2
          ],
          "padding": "same",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "conv2d_50",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_51",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_51",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "max_pooling2d_50",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "max_pooling2d_51",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_51",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            2,
            2
          ],
          "padding": "same",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "conv2d_51",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "flatten_17",
        "class_name": "Flatten",
        "config": {
          "name": "flatten_17",
          "trainable": true,
          "dtype": "float32",
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "max_pooling2d_51",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dense_33",
        "class_name": "Dense",
        "config": {
          "name": "dense_33",
          "trainable": true,
          "dtype": "float32",
          "units": 512,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "flatten_17",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dense_34",
        "class_name": "Dense",
        "config": {
          "name": "dense_34",
          "trainable": true,
          "dtype": "float32",
          "units": 3,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "dense_33",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "input_17",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "dense_34",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.3.1",
  "backend": "tensorflow"
}